/*************************************************************************
	> File Name: unsignedInt.cpp
	> Created Time: Sat 07 Oct 2017 01:37:00 PM CST
 ************************************************************************/
#include <iostream>
using namespace std;

int main()
{
    int a = 1;
    cout << "int a = " << a << endl;
    int b = -1;
    cout << "int b = " << b << endl;
    cout << "usigned int b = " << (unsigned int)b << endl;
/*      
 正数，负数都是补码存储
 -1 的源码   10000000 00000000 00000000 00000001
 -1 的反码   11111111 11111111 11111111 11111110
 -1 的补码   11111111 11111111 11111111 11111111
 在计算机中负数就是全1存储，要推源码-1，取反 
 g++ 不允许对负数进行左移操作
 vs 可以对负数左移操作 都是补符号位
 */
    return 0;
}
