/*************************************************************************
  > File Name: 1.cpp
  > Created Time: Wed 20 Sep 2017 03:50:01 AM PDT
 ************************************************************************/
#include <iostream>
using namespace std;

int main()
{
    int **p;
    int arr[2][3];
    *p = &arr[0][1]; //&arr代表整个数组， *p意思是指向一个整形，
    //arr 单独做右值的， 就是首元素的首地址

    int (*q)[3];     //而首元素又是一个拥有三个元素的一维数组
    q = arr;         //   二维数组名（单独做右值）等价于 （&一维数组名）

    int (*w)[2][3];
    // int **w;
    w = &arr;
    int arr1[2];
    int (* u)[2];
    int * z;
   // ++arr;  arr++;  // error 数组名是常量，不能自++
    u = &arr1;
    z = arr1;
    int arr2[3][2][1];
    int (*a)[2][1];
    int (*b)[3][2][1];
    a = arr2;           //给数组名取地址的话，就是数组指针，一个指针去指向一个数组，注意数组[]的优先级大于* 
    b = &arr2;

    return 0;
}
